{
  "WorkshopId": 3372135059,
  "Title": "Pets & Presets Mash-Up",
  "Description": "[quote=Courage and Sense]It's the custom among patricians that first-born children, slated to inherit nothing of their families' estates, venture out of numb Ibul into the wide world, and that -- in the case of the Iuto family -- they shove off with the companionship of their household's foremost hound. So it came to be that Octadius, grown by manhood into a spiteful wreck, pledged his intention to cross bleak Arthax with his canine Hylaeus, who himself harbored no desire to abandon his lamplighted streets, but -- lacking the rights afforded to dogs in other parts of the world -- was forced to obey. And when Octadius, who cherished courage more than sense, found himself impaled on the fossilized stinger of a manscorpion, Hylaeus could do little more than look on with irritation at his own new predicament, and ponder how he might finish crossing the desert with his life in tow. By a hound's luck, though, several days of vexed wandering were rewarded with the company of a dromad caravan, which saw him safely to the white dunes of the East, and from there, to a curious land called Qud.[/quote]\n\nCompilation mod pack for the [url=https://itch.io/jam/caves-of-qud-modding-jam-3]Caves of Qud Modding Jam: Pets & Presets[/url], which ran at the start of November 2024. See all of the entries [url=https://itch.io/jam/caves-of-qud-modding-jam-3/entries]here[/url]!\n\nA gigantic feathered phase-harmonic thanks to all who participated!\n— The mod jam organizers\n\nAdd a pet while playing using the in-game wish menu (Debug > Wish Menu, bound to shift-W by default) or by wishing 'jamaddpet'. Choose the \"Spawn Every Pet\" pet during character creation to start the game with every pet ([i]chaos will ensue[/i]; also accessible via the wish menu).\n\nThis pack is for the 1.0.4 release (210.X) of Caves of Qud.\n\n[b]Warning:[/b] Do not run this pack simultaneous with any of the mods contained within.\n\n[url=https://itch.io/jam/caves-of-qud-modding-jam-3]Mod jam page (itch)[/url] | [url=https://itch.io/jam/caves-of-qud-modding-jam-3/entries]Mod jam entries (itch)[/url] | [url=https://steamcommunity.com/sharedfiles/filedetails/?id=3372142362]Submissions collection (Steam)[/url] | [url=https://github.com/TrashMonks/caves-of-qud-mod-jam-2024-pets-and-presets]Source Code (GitHub)[/url]\n\n[quote]Octadius pets Hylaeus. Hylaeus puts his snout in Octadius' lap.[/quote]",
  "Tags": "Stable,Pet,Preset",
  "Visibility": "2",
  "ImagePath": "preview.png"
}
