{
  "WorkshopId": 3359933670,
  "Title": "Preset: Denmagn",
  "Description": "[i]Denmagn[/i] is a mutated human preset. It is a tinkering-oriented build designed to allow players to flexibly spec their characters in the middle and late game.\n\nI recommend this preset for players who have played Caves of Qud a bit and have a basic understanding of the game.\n\nYou can either add the build code to your build library (you can find the code [url=https://gitlab.com/kernelmethod/qudmods/-/blob/main/Presets/Denmagn/Denmagn/EmbarkModules.xml]here[/url]), or install this mod (which comes with a custom tile!).\n\nThis mod was made for the [url=https://itch.io/jam/caves-of-qud-modding-jam-3]2024 Pets and Presets mod jam[/url].\n\n[h2]Features[/h2]\n\n[list]\n[*] Electrical generation for early-game damage and for late-game power supply via [url=https://wiki.cavesofqud.com/wiki/Jacked]jacked[/url].\n[*] Double-muscled and triple-jointed allow you to raise your Strength and Agility throughout the game, making you a strong melee or ranged attacker in the late game (depending on which route you decide to take).\n[*] Force wall provides defensive utility and a quick escape hatch.\n[*] Heightened quickness because it's always good :)\n[/list]\n\n[h2]Recommended strategy[/h2]\n\nPlay this build however you please! If you want tips on how I usually play this build, however, then read on:\n\n[list]\n[*] Electrical generation is going to be your main source of damage in the early game. I recommend putting as many mutation points into it as possible, especially between levels 1-15. In the late game it is remains a very strong weapon, particularly against opponents with poor electrical resistance (e.g. robots).\n[*] Force wall is generally good at level 1 and I would avoid putting points into it intentionally (it may still get randomly leveled up because of Irritable Genome).\n[*] I typically use my stat points to level up my intelligence as quickly as possible until I hit Int 29 and get Tinker III. I find that that the added skill points are also tremendously useful. However, if you don't particularly want Tinker III you can instead focus your stat points into any other area of your choosing (I'd usually recommend Strength, Agility, or Toughness).\n[*] This build sometimes struggles with high shop prices due to its low ego. However, it's usually much less of an issues once you get Snake Oiler, which you can always get without investing in Ego from [spoiler]Asphodel[/spoiler]. If you find that you're consistently struggling with prices, you may wish to modify this build slightly by taking one point out of Int and putting two into Ego.\n[*] By the midgame you should be reaching (or close to reaching) Tinker III, and then you can decide which way you want to take the build, e.g. if you want to make it a dagger build, or a pistol build, or so on. You should have a nice stat spread from double-muscled / triple-jointed and a lot of skill points to give you leeway in whichever direction you wish to go.\n[/list]\n\n[h2]Source[/h2]\n\nYou can find the source for this mod on GitLab: https://gitlab.com/kernelmethod/qudmods/-/tree/main/Presets/Denmagn\n\n[h2]See also[/h2]\n\nFor newer players I highly recommend Gnarf's [url=https://steamcommunity.com/sharedfiles/filedetails/?id=2839943576]Rhinoconaut[/url] preset. It's a bit easier to play and shares a lot of the same DNA as Denmagn.",
  "Tags": "Preset",
  "Visibility": "2",
  "ImagePath": "preview.png"
}